tiborsimon/embedded-tdd-headers/pic/pic18/pic18f45k40_tdd.h
#define PSCNT11                       522
#define WDTPSCNT11                    523
#define PSCNT12                       524
#define WDTPSCNT12                    525
#define PSCNT13                       526
#define WDTPSCNT13                    527
#define PSCNT14                       528
#define WDTPSCNT14                    529
#define PSCNT15                       530
#define WDTPSCNT15                    531
#define PSCNT16                       532
#define WDTPSCNT16                    533
#define WDTPSCNT17                    534
#define PSCNT17                       535
#define STATE                         536
#define WDTSTATE                      537
#define WDTTMR                        538
#define WDTTMR0                       539
#define WDTTMR1                       540
#define WDTTMR2                       541
#define WDTTMR3                       542
#define WDTTMR4                       543
#define CPUDOZE                       544
#define DOZE0                         545
#define DOZE                          546
#define DOZE1                         547
#define DOZE2                         548
#define DOE                           549
#define ROI                           550
#define DOZEN                         551
#define IDLEN                         552
#define OSCCON1                       553
#define NDIV0                         554
#define NDIV                          555
#define NDIV1                         556
#define NDIV2                         557
#define NDIV3                         558
#define NOSC0                         559
#define NOSC                          560
#define NOSC1                         561
#define NOSC2                         562
#define OSCCON2                       563
#define CDIV0                         564
#define CDIV                          565
#define CDIV1                         566
#define CDIV2                         567
#define CDIV3                         568
#define COSC                          569
#define COSC0                         570
#define COSC1                         571
#define COSC2                         572
#define OSCCON3                       573
#define NOSCR                         574
#define ORDY                          575
#define SOSCPWR                       576
#define CSWHOLD                       577
#define OSCSTAT                       578
#define PLLR                          579
#define ADOR                          580
#define SOR                           581
#define LFOR                          582
#define MFOR                          583
#define HFOR                          584
#define EXTOR                         585
#define OSCEN                         586
#define ADOEN                         587
#define SOSCEN                        588
#define LFOEN                         589
#define MFOEN                         590
#define HFOEN                         591
#define EXTOEN                        592
#define OSCTUNE                       593
#define TUN0                          594
#define TUN                           595
#define TUN1                          596
#define TUN2                          597
#define TUN3                          598
#define TUN4                          599
#define TUN5                          600
#define OSCFRQ                        601
#define HFFRQ                         602
#define FRQ0                          603
#define FRQ1                          604
#define FRQ2                          605
#define FRQ3                          606
#define VREGCON                       607
#define VREGPM0                       608
#define VREGPM                        609
#define VREGPM1                       610
#define BORCON                        611
#define BORRDY                        612
#define SBOREN                        613
#define PMD0                          614
#define IOCMD                         615
#define CLKRMD                        616
#define SPI1MD                        617
#define SPI2MD                        618
#define NVMMD                         619
#define SCANMD                        620
#define CRCMD                         621
#define HLVDMD                        622
#define FVRMD                         623
#define SYSCMD                        624
#define PMD1                          625
#define EMBMD                         626
#define TMR0MD                        627
#define TMR1MD                        628
#define TMR2MD                        629
#define TMR3MD                        630
#define TMR4MD                        631
#define TMR5MD                        632
#define TMR6MD                        633
#define PMD2                          634
#define ZCDMD                         635
#define CMP1MD                        636
#define CMP2MD                        637
#define ADCMD                         638
#define DACMD                         639
#define PMD3                          640
#define CCP1MD                        641
#define CCP2MD                        642
#define PWM3MD                        643
#define PWM4MD                        644
#define PMD4                          645
#define CWGMD                         646
#define CWG1MD                        647
#define MSSP1MD                       648
#define MSSP2MD                       649
#define UART1MD                       650
#define UART2MD                       651
#define PMD5                          652
#define DSMMD                         653
#define RA0PPS                        654
#define RA0PPS0                       655
#define RA0PPS1                       656
#define RA0PPS2                       657
#define RA0PPS3                       658
#define RA0PPS4                       659
#define RA1PPS                        660
#define RA1PPS0                       661
#define RA1PPS1                       662
#define RA1PPS2                       663
#define RA1PPS3                       664
#define RA1PPS4                       665
#define RA2PPS                        666
#define RA2PPS0                       667
#define RA2PPS1                       668
#define RA2PPS2                       669
#define RA2PPS3                       670
#define RA2PPS4                       671
#define RA3PPS                        672
#define RA3PPS0                       673
#define RA3PPS1                       674
#define RA3PPS2                       675
#define RA3PPS3                       676
#define RA3PPS4                       677
#define RA4PPS                        678
#define RA4PPS0                       679
#define RA4PPS1                       680
#define RA4PPS2                       681
#define RA4PPS3                       682
#define RA4PPS4                       683
#define RA5PPS                        684
#define RA5PPS0                       685
#define RA5PPS1                       686
#define RA5PPS2                       687
#define RA5PPS3                       688
#define RA5PPS4                       689
#define RA6PPS                        690
#define RA6PPS0                       691
#define RA6PPS1                       692
#define RA6PPS2                       693
#define RA6PPS3                       694
#define RA6PPS4                       695
#define RA7PPS                        696
#define RA7PPS0                       697
#define RA7PPS1                       698
#define RA7PPS2                       699
#define RA7PPS3                       700
#define RA7PPS4                       701
#define RB0PPS                        702
#define RB0PPS0                       703
#define RB0PPS1                       704
#define RB0PPS2                       705
#define RB0PPS3                       706
#define RB0PPS4                       707
#define RB1PPS                        708
#define RB1PPS0                       709
#define RB1PPS1                       710
#define RB1PPS2                       711
#define RB1PPS3                       712
#define RB1PPS4                       713
#define RB2PPS                        714
#define RB2PPS0                       715
#define RB2PPS1                       716
#define RB2PPS2                       717
#define RB2PPS3                       718
#define RB2PPS4                       719
#define RB3PPS                        720
#define RB3PPS0                       721
#define RB3PPS1                       722
#define RB3PPS2                       723
#define RB3PPS3                       724
#define RB3PPS4                       725
#define RB4PPS                        726
#define RB4PPS0                       727
#define RB4PPS1                       728
#define RB4PPS2                       729
#define RB4PPS3                       730
#define RB4PPS4                       731
#define RB5PPS                        732
#define RB5PPS0                       733
#define RB5PPS1                       734
#define RB5PPS2                       735
#define RB5PPS3                       736
#define RB5PPS4                       737
#define RB6PPS                        738
#define RB6PPS0                       739
#define RB6PPS1                       740
#define RB6PPS2                       741
#define RB6PPS3                       742
#define RB6PPS4                       743
#define RB7PPS                        744
#define RB7PPS0                       745
#define RB7PPS1                       746
#define RB7PPS2                       747
#define RB7PPS3                       748
#define RB7PPS4                       749
#define RC0PPS                        750
#define RC0PPS0                       751
#define RC0PPS1                       752
#define RC0PPS2                       753
#define RC0PPS3                       754
#define RC0PPS4                       755
#define RC1PPS                        756
#define RC1PPS0                       757
#define RC1PPS1                       758
#define RC1PPS2                       759
#define RC1PPS3                       760
#define RC1PPS4                       761
#define RC2PPS                        762
#define RC2PPS0                       763
#define RC2PPS1                       764
#define RC2PPS2                       765
#define RC2PPS3                       766
#define RC2PPS4                       767
#define RC3PPS                        768
#define RC3PPS0                       769
#define RC3PPS1                       770
#define RC3PPS2                       771
#define RC3PPS3                       772
#define RC3PPS4                       773
#define RC4PPS                        774
#define RC4PPS0                       775
#define RC4PPS1                       776
#define RC4PPS2                       777
#define RC4PPS3                       778
#define RC4PPS4                       779
#define RC5PPS                        780
#define RC5PPS0                       781
#define RC5PPS1                       782
#define RC5PPS2                       783
#define RC5PPS3                       784
#define RC5PPS4                       785
#define RC6PPS                        786
#define RC6PPS0                       787
#define RC6PPS1                       788
#define RC6PPS2                       789
#define RC6PPS3                       790
#define RC6PPS4                       791
#define RC7PPS                        792
#define RC7PPS0                       793
#define RC7PPS1                       794
#define RC7PPS2                       795
#define RC7PPS3                       796
#define RC7PPS4                       797
#define RD0PPS                        798
#define RD0PPS0                       799
#define RD0PPS1                       800
#define RD0PPS2                       801
#define RD0PPS3                       802
#define RD0PPS4                       803
#define RD1PPS                        804
#define RD1PPS0                       805
#define RD1PPS1                       806
#define RD1PPS2                       807
#define RD1PPS3                       808
#define RD1PPS4                       809
#define RD2PPS                        810
#define RD2PPS0                       811
#define RD2PPS1                       812
#define RD2PPS2                       813
#define RD2PPS3                       814
#define RD2PPS4                       815
#define RD3PPS                        816
#define RD3PPS0                       817
#define RD3PPS1                       818
#define RD3PPS2                       819
#define RD3PPS3                       820
#define RD3PPS4                       821
#define RD4PPS                        822
#define RD4PPS0                       823
#define RD4PPS1                       824
#define RD4PPS2                       825
#define RD4PPS3                       826
#define RD4PPS4                       827
#define RD5PPS                        828
#define RD5PPS0                       829
#define RD5PPS1                       830
#define RD5PPS2                       831
#define RD5PPS3                       832
#define RD5PPS4                       833
#define RD6PPS                        834
#define RD6PPS0                       835
#define RD6PPS1                       836
#define RD6PPS2                       837
#define RD6PPS3                       838
#define RD6PPS4                       839
#define RD7PPS                        840
#define RD7PPS0                       841
#define RD7PPS1                       842
#define RD7PPS2                       843
#define RD7PPS3                       844
#define RD7PPS4                       845
#define RE0PPS                        846
#define RE0PPS0                       847
#define RE0PPS1                       848
#define RE0PPS2                       849
#define RE0PPS3                       850
#define RE0PPS4                       851
#define RE1PPS                        852
#define RE1PPS0                       853
#define RE1PPS1                       854
#define RE1PPS2                       855
#define RE1PPS3                       856
#define RE1PPS4                       857
#define RE2PPS                        858
#define RE2PPS0                       859
#define RE2PPS1                       860
#define RE2PPS2                       861
#define RE2PPS3                       862
#define RE2PPS4                       863
#define IOCAF                         864
#define IOCAF0                        865
#define IOCAF1                        866
#define IOCAF2                        867
#define IOCAF3                        868
#define IOCAF4                        869
#define IOCAF5                        870
#define IOCAF6                        871
#define IOCAF7                        872
#define IOCAN                         873
#define IOCAN0                        874
#define IOCAN1                        875
#define IOCAN2                        876
#define IOCAN3                        877
#define IOCAN4                        878
#define IOCAN5                        879
#define IOCAN6                        880
#define IOCAN7                        881
#define IOCAP                         882
#define IOCAP0                        883
#define IOCAP1                        884
#define IOCAP2                        885
#define IOCAP3                        886
#define IOCAP4                        887
#define IOCAP5                        888
#define IOCAP6                        889
#define IOCAP7                        890
#define INLVLA                        891
#define INLVLA0                       892
#define INLVLA1                       893
#define INLVLA2                       894
#define INLVLA3                       895
#define INLVLA4                       896
#define INLVLA5                       897
#define INLVLA6                       898
#define INLVLA7                       899
#define SLRCONA                       900
#define SLRA0                         901
#define SLRA1                         902
#define SLRA2                         903
#define SLRA3                         904
#define SLRA4                         905
#define SLRA5                         906
#define SLRA6                         907
#define SLRA7                         908
#define ODCONA                        909
#define ODCA0                         910
#define ODCA1                         911
#define ODCA2                         912
#define ODCA3                         913
#define ODCA4                         914
#define ODCA5                         915
#define ODCA6                         916
#define ODCA7                         917
#define WPUA                          918
#define WPUA0                         919
#define WPUA1                         920
#define WPUA2                         921
#define WPUA3                         922
#define WPUA4                         923
#define WPUA5                         924
#define WPUA6                         925
#define WPUA7                         926
#define ANSELA                        927
#define ANSELA0                       928
#define ANSELA1                       929
#define ANSELA2                       930
#define ANSELA3                       931
#define ANSELA4                       932
#define ANSELA5                       933
#define ANSELA6                       934
#define ANSELA7                       935
#define IOCBF                         936
#define IOCBF0                        937
#define IOCBF1                        938
#define IOCBF2                        939
#define IOCBF3                        940
#define IOCBF4                        941
#define IOCBF5                        942
#define IOCBF6                        943
#define IOCBF7                        944
#define IOCBN                         945
#define IOCBN0                        946
#define IOCBN1                        947
#define IOCBN2                        948
#define IOCBN3                        949
#define IOCBN4                        950
#define IOCBN5                        951
#define IOCBN6                        952
#define IOCBN7                        953
#define IOCBP                         954
#define IOCBP0                        955
#define IOCBP1                        956
#define IOCBP2                        957
#define IOCBP3                        958
#define IOCBP4                        959
#define IOCBP5                        960
#define IOCBP6                        961
#define IOCBP7                        962
#define INLVLB                        963
#define INLVLB0                       964
#define INLVLB1                       965
#define INLVLB2                       966
#define INLVLB3                       967
#define INLVLB4                       968
#define INLVLB5                       969
#define INLVLB6                       970
#define INLVLB7                       971
#define SLRCONB                       972
#define SLRB0                         973
#define SLRB1                         974
#define SLRB2                         975
#define SLRB3                         976
#define SLRB4                         977
#define SLRB5                         978
#define SLRB6                         979
#define SLRB7                         980
#define ODCONB                        981
#define ODCB0                         982
#define ODCB1                         983
#define ODCB2                         984
#define ODCB3                         985
#define ODCB4                         986
#define ODCB5                         987
#define ODCB6                         988
#define ODCB7                         989
#define WPUB                          990
#define WPUB0                         991
#define WPUB1                         992
#define WPUB2                         993
#define WPUB3                         994
#define WPUB4                         995
#define WPUB5                         996
#define WPUB6                         997
#define WPUB7                         998
#define ANSELB                        999
#define ANSELB0                       1000
#define ANSELB1                       1001
#define ANSELB2                       1002
#define ANSELB3                       1003
#define ANSELB4                       1004
#define ANSELB5                       1005
#define ANSELB6                       1006
#define ANSELB7                       1007
#define IOCCF                         1008
#define IOCCF0                        1009
#define IOCCF1                        1010
#define IOCCF2                        1011
#define IOCCF3                        1012
#define IOCCF4                        1013
#define IOCCF5                        1014
#define IOCCF6                        1015
#define IOCCF7                        1016
#define IOCCN                         1017
#define IOCCN0                        1018
#define IOCCN1                        1019
#define IOCCN2                        1020
#define IOCCN3                        1021
#define IOCCN4                        1022
#define IOCCN5                        1023
#define IOCCN6                        1024
#define IOCCN7                        1025
#define IOCCP                         1026
#define IOCCP0                        1027
#define IOCCP1                        1028
#define IOCCP2                        1029
#define IOCCP3                        1030
#define IOCCP4                        1031
#define IOCCP5                        1032
#define IOCCP6                        1033
#define IOCCP7                        1034
#define INLVLC                        1035
#define INLVLC0                       1036
#define INLVLC1                       1037
#define INLVLC2                       1038
#define INLVLC3                       1039
#define INLVLC4                       1040
#define INLVLC5                       1041
#define INLVLC6                       1042
#define INLVLC7                       1043
#define SLRCONC                       1044
#define SLRC0                         1045
#define SLRC1                         1046
#define SLRC2                         1047
#define SLRC3                         1048
#define SLRC4                         1049
#define SLRC5                         1050
#define SLRC6                         1051
#define SLRC7                         1052
#define ODCONC                        1053
#define ODCC0                         1054
#define ODCC1                         1055
#define ODCC2                         1056
#define ODCC3                         1057
#define ODCC4                         1058
#define ODCC5                         1059
#define ODCC6                         1060
#define ODCC7                         1061
#define WPUC                          1062
#define WPUC0                         1063
#define WPUC1                         1064
#define WPUC2                         1065
#define WPUC3                         1066
#define WPUC4                         1067
#define WPUC5                         1068
#define WPUC6                         1069
#define WPUC7                         1070
#define ANSELC                        1071
#define ANSELC0                       1072
#define ANSELC1                       1073
#define ANSELC2                       1074
#define ANSELC3                       1075
#define ANSELC4                       1076
#define ANSELC5                       1077
#define ANSELC6                       1078
#define ANSELC7                       1079
#define INLVLD                        1080
#define INLVLD0                       1081
#define INLVLD1                       1082
#define INLVLD2                       1083
#define INLVLD3                       1084
#define INLVLD4                       1085
#define INLVLD5                       1086
#define INLVLD6                       1087
#define INLVLD7                       1088
#define SLRCOND                       1089
#define SLRD0                         1090
