tiborsimon/embedded-tdd-headers/pic/pic18/pic18f45k40_tdd.h
#define SSP1ADD_SSPADD                2207
#define SSP1ADD_MSK0                  2208
#define MSK01                         2209
#define SSP1ADD_MSK1                  2210
#define MSK11                         2211
#define SSP1ADD_MSK2                  2212
#define MSK21                         2213
#define MSK31                         2214
#define SSP1ADD_MSK3                  2215
#define SSP1ADD_MSK4                  2216
#define MSK41                         2217
#define MSK51                         2218
#define SSP1ADD_MSK5                  2219
#define SSP1ADD_MSK6                  2220
#define MSK61                         2221
#define MSK71                         2222
#define SSP1ADD_MSK7                  2223
#define SSP1MSK                       2224
#define SSP1MSK_MSK0                  2225
#define SSP1MSK_SSPMSK                2226
#define SSP1MSK_MSK1                  2227
#define SSP1MSK_MSK2                  2228
#define SSP1MSK_MSK3                  2229
#define SSP1MSK_MSK4                  2230
#define SSP1MSK_MSK5                  2231
#define SSP1MSK_MSK6                  2232
#define SSP1MSK_MSK7                  2233
#define SSP1STAT                      2234
#define BF1                           2235
#define SSP1STAT_BF                   2236
#define UA1                           2237
#define SSP1STAT_UA                   2238
#define SSP1STAT_R_NOT_W              2239
#define RW1                           2240
#define SSP1STAT_nW                   2241
#define RW                            2242
#define SSP1STAT_READ_WRITE           2243
#define SSP1STAT_nWRITE               2244
#define SSP1STAT_I2C_READ             2245
#define SSP1STAT_R_W                  2246
#define R                             2247
#define SSP1STAT_NOT_WRITE            2248
#define SSP1STAT_R_nW                 2249
#define SSP1STAT_S                    2250
#define START                         2251
#define START1                        2252
#define SSP1STAT_I2C_START            2253
#define STOP                          2254
#define SSP1STAT_P                    2255
#define STOP1                         2256
#define SSP1STAT_I2C_STOP             2257
#define SSP1STAT_D_NOT_A              2258
#define SSP1STAT_D_A                  2259
#define SSP1STAT_D_nA                 2260
#define SSP1STAT_NOT_ADDRESS          2261
#define SSP1STAT_DATA_ADDRESS         2262
#define SSP1STAT_nA                   2263
#define D                             2264
#define DA1                           2265
#define DA                            2266
#define SSP1STAT_nADDRESS             2267
#define SSP1STAT_I2C_DAT              2268
#define SSP1STAT_CKE                  2269
#define CKE1                          2270
#define SSP1STAT_SMP                  2271
#define SMP1                          2272
#define SSP1CON1                      2273
#define SSP1CON1_SSPM0                2274
#define SSPM01                        2275
#define SSP1CON1_SSPM                 2276
#define SSP1CON1_SSPM1                2277
#define SSPM11                        2278
#define SSP1CON1_SSPM2                2279
#define SSPM21                        2280
#define SSPM31                        2281
#define SSP1CON1_SSPM3                2282
#define SSP1CON1_CKP                  2283
#define CKP1                          2284
#define SSPEN1                        2285
#define SSP1CON1_SSPEN                2286
#define SSPOV1                        2287
#define SSP1CON1_SSPOV                2288
#define WCOL1                         2289
#define SSP1CON1_WCOL                 2290
#define SSP1CON2                      2291
#define SEN1                          2292
#define SSP1CON2_SEN                  2293
#define ADMSK11                       2294
#define SSP1CON2_RSEN                 2295
#define RSEN1                         2296
#define SSP1CON2_ADMSK1               2297
#define SSP1CON2_ADMSK                2298
#define SSP1CON2_PEN                  2299
#define ADMSK21                       2300
#define PEN1                          2301
#define SSP1CON2_ADMSK2               2302
#define ADMSK31                       2303
#define RCEN1                         2304
#define SSP1CON2_RCEN                 2305
#define SSP1CON2_ADMSK3               2306
#define SSP1CON2_ACKEN                2307
#define ACKEN1                        2308
#define ADMSK41                       2309
#define SSP1CON2_ADMSK4               2310
#define ACKDT1                        2311
#define ADMSK51                       2312
#define SSP1CON2_ACKDT                2313
#define SSP1CON2_ADMSK5               2314
#define SSP1CON2_ACKSTAT              2315
#define ACKSTAT1                      2316
#define GCEN1                         2317
#define SSP1CON2_GCEN                 2318
#define SSP1CON3                      2319
#define SSP1CON3_DHEN                 2320
#define SSP1CON3_AHEN                 2321
#define SSP1CON3_SBCDE                2322
#define SSP1CON3_SDAHT                2323
#define SSP1CON3_BOEN                 2324
#define SSP1CON3_SCIE                 2325
#define SSP1CON3_PCIE                 2326
#define SSP1CON3_ACKTIM               2327
#define RC1REG                        2328
#define TX1REG                        2329
#define SP1BRGL                       2330
#define SP1BRGH                       2331
#define RC1STA                        2332
#define RC1STA_RX9D                   2333
#define RCD8                          2334
#define RC1STA_OERR                   2335
#define RC1STA_FERR                   2336
#define RC1STA_ADDEN                  2337
#define RC1STA_CREN                   2338
#define RC1STA_SREN                   2339
#define RC1STA_RX9                    2340
#define RC8_9                         2341
#define RC9                           2342
#define RC1STA_SPEN                   2343
#define TX1STA                        2344
#define TXD8                          2345
#define TX1STA_TX9D                   2346
#define TX1STA_TRMT                   2347
#define TX1STA_BRGH                   2348
#define TX1STA_SENDB                  2349
#define TX1STA_SYNC                   2350
#define TX1STA_TXEN                   2351
#define TX1STA_TX9                    2352
#define TX8_9                         2353
#define TX1STA_CSRC                   2354
#define BAUD1CON                      2355
#define ABDEN1                        2356
#define BAUD1CON_ABDEN                2357
#define WUE1                          2358
#define BAUD1CON_WUE                  2359
#define BRG161                        2360
#define BAUD1CON_BRG16                2361
#define SCKP1                         2362
#define CKTXP                         2363
#define TXCKP                         2364
#define BAUD1CON_SCKP                 2365
#define TXCKP1                        2366
#define BAUD1CON_RCIDL                2367
#define RCMT1                         2368
#define RCIDL1                        2369
#define RCMT                          2370
#define BAUD1CON_ABDOVF               2371
#define ABDOVF1                       2372
#define PWM4DCL                       2373
#define PWM4DCL_PWMPW0                2374
#define PWM4DCL_DC                    2375
#define PWM4DC0                       2376
#define PWM4DCL_DC0                   2377
#define PWM4DCL_PWMPW1                2378
#define PWM4DC1                       2379
#define PWM4DCL_DC1                   2380
#define PWM4DCH                       2381
#define PWM4DCH_PWMPW2                2382
#define PWM4DCH_DC                    2383
#define PWM4DC2                       2384
#define PWM4DCH_DC2                   2385
#define PWM4DCH_PWMPW3                2386
#define PWM4DC3                       2387
#define PWM4DCH_DC3                   2388
#define PWM4DCH_PWMPW4                2389
#define PWM4DC4                       2390
#define PWM4DCH_DC4                   2391
#define PWM4DCH_PWMPW5                2392
#define PWM4DC5                       2393
#define PWM4DCH_DC5                   2394
#define PWM4DCH_PWMPW6                2395
#define PWM4DC6                       2396
#define PWM4DCH_DC6                   2397
#define PWM4DCH_PWMPW7                2398
#define PWM4DC7                       2399
#define PWM4DCH_DC7                   2400
#define PWM4DCH_PWMPW8                2401
#define PWM4DC8                       2402
#define PWM4DCH_DC8                   2403
#define PWM4DCH_PWMPW9                2404
#define PWM4DC9                       2405
#define PWM4DCH_DC9                   2406
#define PWM4CON                       2407
#define PWM4POL                       2408
#define PWM4CON_POL                   2409
#define PWM4CON_OUT                   2410
#define PWM4OUT                       2411
#define PWM4EN                        2412
#define PWM4CON_EN                    2413
#define PWM3DCL                       2414
#define PWM3DC0                       2415
#define PWM3DCL_PWMPW0                2416
#define PWM3DCL_DC0                   2417
#define PWM3DCL_DC                    2418
#define PWM3DC1                       2419
#define PWM3DCL_PWMPW1                2420
#define PWM3DCL_DC1                   2421
#define PWM3DCH                       2422
#define PWM3DC2                       2423
#define PWM3DCH_DC2                   2424
#define PWM3DCH_DC                    2425
#define PWM3DCH_PWMPW2                2426
#define PWM3DC3                       2427
#define PWM3DCH_DC3                   2428
#define PWM3DCH_PWMPW3                2429
#define PWM3DC4                       2430
#define PWM3DCH_DC4                   2431
#define PWM3DCH_PWMPW4                2432
#define PWM3DC5                       2433
#define PWM3DCH_DC5                   2434
#define PWM3DCH_PWMPW5                2435
#define PWM3DC6                       2436
#define PWM3DCH_DC6                   2437
#define PWM3DCH_PWMPW6                2438
#define PWM3DC7                       2439
#define PWM3DCH_DC7                   2440
#define PWM3DCH_PWMPW7                2441
#define PWM3DC8                       2442
#define PWM3DCH_DC8                   2443
#define PWM3DCH_PWMPW8                2444
#define PWM3DC9                       2445
#define PWM3DCH_DC9                   2446
#define PWM3DCH_PWMPW9                2447
#define PWM3CON                       2448
#define PWM3CON_POL                   2449
#define PWM3POL                       2450
#define PWM3CON_OUT                   2451
#define PWM3OUT                       2452
#define PWM3EN                        2453
#define PWM3CON_EN                    2454
#define CCPR2L                        2455
#define CCPR2L_RL                     2456
#define CCPR2H                        2457
#define CCPR2H_RH                     2458
#define CCP2CON                       2459
#define CCP2MODE                      2460
#define CCP2MODE0                     2461
#define CCP2CON_MODE0                 2462
#define CCP2CON_MODE                  2463
#define CCP2MODE1                     2464
#define CCP2CON_MODE1                 2465
#define CCP2MODE2                     2466
#define CCP2CON_MODE2                 2467
#define CCP2MODE3                     2468
#define CCP2CON_MODE3                 2469
#define CCP2FMT                       2470
#define CCP2CON_FMT                   2471
#define CCP2OUT                       2472
#define CCP2CON_OUT                   2473
#define CCP2EN                        2474
#define CCP2CON_EN                    2475
#define CCP2CAP                       2476
#define CCP2CAP_CTS                   2477
#define CCP2CAP_CTS0                  2478
#define CCP2CTS                       2479
#define CCP2CTS0                      2480
#define CCP2CAP_CTS1                  2481
#define CCP2CTS1                      2482
#define CCPR1L                        2483
#define CCPR1L_RL                     2484
#define CCPR1H                        2485
#define CCPR1H_RH                     2486
#define CCP1CON                       2487
#define CCP1MODE0                     2488
#define CCP1CON_MODE0                 2489
#define CCP1CON_MODE                  2490
#define CCP1MODE                      2491
#define CCP1MODE1                     2492
#define CCP1CON_MODE1                 2493
#define CCP1MODE2                     2494
#define CCP1CON_MODE2                 2495
#define CCP1MODE3                     2496
#define CCP1CON_MODE3                 2497
#define CCP1FMT                       2498
#define CCP1CON_FMT                   2499
#define CCP1CON_OUT                   2500
#define CCP1OUT                       2501
#define CCP1EN                        2502
#define CCP1CON_EN                    2503
#define P1M1                          2504
#define CCP1CAP                       2505
#define CCP1CTS0                      2506
#define CCP1CAP_CTS                   2507
#define CCP1CAP_CTS0                  2508
#define CCP1CTS                       2509
#define CCP1CTS1                      2510
#define CCP1CAP_CTS1                  2511
#define CCPTMRS                       2512
#define C1TSEL0                       2513
#define C1TSEL                        2514
#define C1TSEL1                       2515
#define C2TSEL0                       2516
#define C2TSEL                        2517
#define C2TSEL1                       2518
#define P3TSEL                        2519
#define P3TSEL0                       2520
#define P3TSEL1                       2521
#define P4TSEL0                       2522
#define P4TSEL                        2523
#define P4TSEL1                       2524
#define T6TMR                         2525
#define TMR6                          2526
#define T6PR                          2527
#define PR6                           2528
#define T6CON                         2529
#define T6CON_OUTPS0                  2530
#define T6OUTPS                       2531
#define T6CON_OUTPS                   2532
#define T6OUTPS0                      2533
#define T6CON_OUTPS1                  2534
#define T6OUTPS1                      2535
#define T6CON_OUTPS2                  2536
#define T6OUTPS2                      2537
#define T6CON_OUTPS3                  2538
#define T6OUTPS3                      2539
#define T6CON_CKPS0                   2540
#define T6CKPS                        2541
#define T6CKPS0                       2542
#define T6CON_CKPS                    2543
#define T6CON_CKPS1                   2544
#define T6CKPS1                       2545
#define T6CON_CKPS2                   2546
#define T6CKPS2                       2547
#define TMR6ON                        2548
#define T6ON                          2549
#define T6CON_ON                      2550
#define T6HLT                         2551
#define T6HLT_MODE0                   2552
#define T6HLT_MODE                    2553
#define T6MODE0                       2554
#define T6MODE                        2555
#define T6HLT_MODE1                   2556
#define T6MODE1                       2557
#define T6MODE2                       2558
#define T6HLT_MODE2                   2559
#define T6HLT_MODE3                   2560
#define T6MODE3                       2561
#define T6MODE4                       2562
#define T6HLT_MODE4                   2563
#define T6CKSYNC                      2564
#define T6HLT_CKSYNC                  2565
#define T6CKPOL                       2566
#define T6HLT_CKPOL                   2567
#define T6PSYNC                       2568
#define T6HLT_PSYNC                   2569
#define T6CLKCON                      2570
#define T6CS                          2571
#define T6CS0                         2572
#define T6CS1                         2573
#define T6CS2                         2574
#define T6CS3                         2575
#define T6RST                         2576
#define T6RST_RSEL                    2577
#define T6RST_RSEL0                   2578
#define T6RSEL                        2579
#define T6RSEL0                       2580
#define T6RST_RSEL1                   2581
#define T6RSEL1                       2582
#define T6RSEL2                       2583
#define T6RST_RSEL2                   2584
#define T6RST_RSEL3                   2585
#define T6RSEL3                       2586
#define T4TMR                         2587
#define TMR4                          2588
#define T4PR                          2589
#define PR4                           2590
#define T4CON                         2591
#define T4OUTPS0                      2592
#define T4CON_OUTPS                   2593
#define T4OUTPS                       2594
#define T4CON_OUTPS0                  2595
#define T4OUTPS1                      2596
#define T4CON_OUTPS1                  2597
#define T4CON_OUTPS2                  2598
#define T4OUTPS2                      2599
#define T4OUTPS3                      2600
#define T4CON_OUTPS3                  2601
#define T4CON_CKPS0                   2602
#define T4CKPS0                       2603
#define T4CON_CKPS                    2604
#define T4CKPS                        2605
#define T4CKPS1                       2606
#define T4CON_CKPS1                   2607
#define T4CKPS2                       2608
#define T4CON_CKPS2                   2609
#define T4ON                          2610
#define T4CON_ON                      2611
#define TMR4ON                        2612
#define T4HLT                         2613
#define T4MODE                        2614
#define T4HLT_MODE                    2615
#define T4HLT_MODE0                   2616
#define T4MODE0                       2617
#define T4HLT_MODE1                   2618
#define T4MODE1                       2619
#define T4HLT_MODE2                   2620
#define T4MODE2                       2621
#define T4HLT_MODE3                   2622
#define T4MODE3                       2623
#define T4HLT_MODE4                   2624
#define T4MODE4                       2625
#define T4HLT_CKSYNC                  2626
#define T4CKSYNC                      2627
#define T4HLT_CKPOL                   2628
#define T4CKPOL                       2629
#define T4PSYNC                       2630
#define T4HLT_PSYNC                   2631
#define T4CLKCON                      2632
#define T4CS0                         2633
#define T4CS                          2634
#define T4CS1                         2635
#define T4CS2                         2636
#define T4CS3                         2637
#define T4RST                         2638
#define T4RSEL0                       2639
#define T4RSEL                        2640
#define T4RST_RSEL                    2641
#define T4RST_RSEL0                   2642
#define T4RSEL1                       2643
#define T4RST_RSEL1                   2644
#define T4RSEL2                       2645
#define T4RST_RSEL2                   2646
#define T4RSEL3                       2647
#define T4RST_RSEL3                   2648
#define T2TMR                         2649
#define TMR2                          2650
#define T2PR                          2651
#define PR2                           2652
#define T2CON                         2653
#define T2OUTPS0                      2654
#define T2CON_OUTPS0                  2655
#define T2OUTPS                       2656
#define T2CON_OUTPS                   2657
#define T2OUTPS1                      2658
#define T2CON_OUTPS1                  2659
#define T2OUTPS2                      2660
#define T2CON_OUTPS2                  2661
#define T2OUTPS3                      2662
#define T2CON_OUTPS3                  2663
#define T2CKPS0                       2664
#define T2CON_CKPS                    2665
#define T2CKPS                        2666
#define T2CON_CKPS0                   2667
#define T2CKPS1                       2668
#define T2CON_CKPS1                   2669
#define T2CKPS2                       2670
#define T2CON_CKPS2                   2671
#define T2CON_ON                      2672
#define TMR2ON                        2673
#define T2ON                          2674
#define T2HLT                         2675
#define T2HLT_MODE                    2676
#define T2MODE                        2677
#define T2MODE0                       2678
#define T2HLT_MODE0                   2679
#define T2MODE1                       2680
#define T2HLT_MODE1                   2681
#define T2MODE2                       2682
#define T2HLT_MODE2                   2683
#define T2MODE3                       2684
#define T2HLT_MODE3                   2685
#define T2MODE4                       2686
#define T2HLT_MODE4                   2687
#define T2HLT_CKSYNC                  2688
#define T2CKSYNC                      2689
#define T2HLT_CKPOL                   2690
#define T2CKPOL                       2691
#define T2PSYNC                       2692
#define T2HLT_PSYNC                   2693
#define T2CLKCON                      2694
#define T2CS                          2695
#define T2CS0                         2696
#define T2CS1                         2697
#define T2CS2                         2698
#define T2CS3                         2699
#define T2RST                         2700
#define T2RSEL0                       2701
#define T2RST_RSEL                    2702
#define T2RSEL                        2703
#define T2RST_RSEL0                   2704
#define T2RSEL1                       2705
#define T2RST_RSEL1                   2706
#define T2RST_RSEL2                   2707
#define T2RSEL2                       2708
#define T2RSEL3                       2709
#define T2RST_RSEL3                   2710
#define TMR5L                         2711
#define TMR5L0                        2712
#define TMR5L1                        2713
#define TMR5L2                        2714
#define TMR5L3                        2715
#define TMR5L4                        2716
#define TMR5L5                        2717
#define TMR5L6                        2718
#define TMR5L7                        2719
#define TMR5H0                        2720
#define TMR5H                         2721
#define TMR5H1                        2722
#define TMR5H2                        2723
#define TMR5H3                        2724
#define TMR5H4                        2725
#define TMR5H5                        2726
#define TMR5H6                        2727
#define TMR5H7                        2728
#define T5CON                         2729
#define T5CON_ON                      2730
#define TMR5ON                        2731
#define T5CON_RD16                    2732
#define T5RD16                        2733
#define RD165                         2734
#define nT5SYNC                       2735
#define T5CON_nSYNC                   2736
#define T5CON_NOT_SYNC                2737
#define NOT_T5SYNC                    2738
#define T5CON_CKPS0                   2739
#define T5CON_CKPS                    2740
#define T5CKPS0                       2741
#define T5CON_CKPS1                   2742
#define T5CKPS1                       2743
#define T5GCON                        2744
#define T5GCON_GVAL                   2745
#define T5GVAL                        2746
#define T5GGO_nDONE                   2747
#define T5GCON_GGO_NOT_DONE           2748
#define T5GCON_GGO_nDONE              2749
#define T5GGO_NOT_DONE                2750
#define T5GGO                         2751
#define T5GCON_GSPM                   2752
#define T5GSPM                        2753
#define T5GTM                         2754
#define T5GCON_GTM                    2755
#define T5GPOL                        2756
#define T5GCON_GPOL                   2757
#define T5GCON_GE                     2758
#define T5GE                          2759
#define T5GATE                        2760
#define T5GATE_GSS0                   2761
#define T5GSS0                        2762
#define T5GATE_GSS                    2763
#define T5GATE_GSS1                   2764
