tiborsimon/embedded-tdd-headers/pic/pic18/pic18f45k40_tdd.h
#define T5GSS1                        2765
#define T5GATE_GSS2                   2766
#define T5GSS2                        2767
#define T5GATE_GSS3                   2768
#define T5GSS3                        2769
#define T5CLK                         2770
#define T5CS0                         2771
#define T5CLK_CS                      2772
#define T5CLK_CS0                     2773
#define T5CS1                         2774
#define T5CLK_CS1                     2775
#define T5CS2                         2776
#define T5CLK_CS2                     2777
#define T5CS3                         2778
#define T5CLK_CS3                     2779
#define TMR3L0                        2780
#define TMR3L                         2781
#define TMR3L1                        2782
#define TMR3L2                        2783
#define TMR3L3                        2784
#define TMR3L4                        2785
#define TMR3L5                        2786
#define TMR3L6                        2787
#define TMR3L7                        2788
#define TMR3H                         2789
#define TMR3H0                        2790
#define TMR3H1                        2791
#define TMR3H2                        2792
#define TMR3H3                        2793
#define TMR3H4                        2794
#define TMR3H5                        2795
#define TMR3H6                        2796
#define TMR3H7                        2797
#define T3CON                         2798
#define T3CON_ON                      2799
#define TMR3ON                        2800
#define T3CON_RD16                    2801
#define RD163                         2802
#define T3RD16                        2803
#define T3CON_NOT_SYNC                2804
#define T3CON_nSYNC                   2805
#define NOT_T3SYNC                    2806
#define nT3SYNC                       2807
#define T3CKPS0                       2808
#define T3CON_CKPS0                   2809
#define T3CON_CKPS                    2810
#define T3CKPS1                       2811
#define T3CON_CKPS1                   2812
#define T3GCON                        2813
#define T3GVAL                        2814
#define T3GCON_GVAL                   2815
#define T3GGO                         2816
#define T3GGO_NOT_DONE                2817
#define T3GCON_GGO_nDONE              2818
#define T3GGO_nDONE                   2819
#define T3GCON_GGO_NOT_DONE           2820
#define T3GCON_GSPM                   2821
#define T3GSPM                        2822
#define T3GCON_GTM                    2823
#define T3GTM                         2824
#define T3GCON_GPOL                   2825
#define T3GPOL                        2826
#define T3GCON_GE                     2827
#define T3GE                          2828
#define T3GATE                        2829
#define T3GSS0                        2830
#define T3GATE_GSS0                   2831
#define T3GATE_GSS                    2832
#define T3GSS1                        2833
#define T3GATE_GSS1                   2834
#define T3GSS2                        2835
#define T3GATE_GSS2                   2836
#define T3GSS3                        2837
#define T3GATE_GSS3                   2838
#define T3CLK                         2839
#define T3CLK_CS                      2840
#define T3CLK_CS0                     2841
#define T3CS0                         2842
#define T3CLK_CS1                     2843
#define T3CS1                         2844
#define T3CLK_CS2                     2845
#define T3CS2                         2846
#define T3CS3                         2847
#define T3CLK_CS3                     2848
#define TMR1L                         2849
#define TMR1L0                        2850
#define TMR1L1                        2851
#define TMR1L2                        2852
#define TMR1L3                        2853
#define TMR1L4                        2854
#define TMR1L5                        2855
#define TMR1L6                        2856
#define TMR1L7                        2857
#define TMR1H0                        2858
#define TMR1H                         2859
#define TMR1H1                        2860
#define TMR1H2                        2861
#define TMR1H3                        2862
#define TMR1H4                        2863
#define TMR1H5                        2864
#define TMR1H6                        2865
#define TMR1H7                        2866
#define T1CON                         2867
#define TMR1ON                        2868
#define T1CON_ON                      2869
#define T1CON_RD16                    2870
#define T1RD16                        2871
#define NOT_T1SYNC                    2872
#define T1CON_nSYNC                   2873
#define nT1SYNC                       2874
#define T1CON_NOT_SYNC                2875
#define T1CON_CKPS0                   2876
#define T1CKPS0                       2877
#define T1CON_CKPS                    2878
#define T1CKPS1                       2879
#define T1CON_CKPS1                   2880
#define T1GCON                        2881
#define T1GCON_GVAL                   2882
#define T1GVAL                        2883
#define T1GGO_NOT_DONE                2884
#define T1GGO_nDONE                   2885
#define T1GCON_GGO_nDONE              2886
#define T1GCON_GGO_NOT_DONE           2887
#define T1GGO                         2888
#define T1GCON_GSPM                   2889
#define T1GSPM                        2890
#define T1GTM                         2891
#define T1GCON_GTM                    2892
#define T1GPOL                        2893
#define T1GCON_GPOL                   2894
#define T1GCON_GE                     2895
#define T1GE                          2896
#define T1GATE                        2897
#define T1GATE_GSS0                   2898
#define T1GSS0                        2899
#define T1GATE_GSS                    2900
#define T1GATE_GSS1                   2901
#define T1GSS1                        2902
#define T1GSS2                        2903
#define T1GATE_GSS2                   2904
#define T1GSS3                        2905
#define T1GATE_GSS3                   2906
#define T1CLK                         2907
#define T1CS0                         2908
#define T1CLK_CS                      2909
#define T1CLK_CS0                     2910
#define T1CLK_CS1                     2911
#define T1CS1                         2912
#define T1CS2                         2913
#define T1CLK_CS2                     2914
#define T1CS3                         2915
#define T1CLK_CS3                     2916
#define TMR0L0                        2917
#define TMR0L                         2918
#define TMR0L1                        2919
#define TMR0L2                        2920
#define TMR0L3                        2921
#define TMR0L4                        2922
#define TMR0L5                        2923
#define TMR0L6                        2924
#define TMR0L7                        2925
#define TMR0H0                        2926
#define T0PR                          2927
#define TMR0H                         2928
#define T0PR0                         2929
#define TMR0H1                        2930
#define T0PR1                         2931
#define TMR0H2                        2932
#define T0PR2                         2933
#define TMR0H3                        2934
#define T0PR3                         2935
#define TMR0H4                        2936
#define T0PR4                         2937
#define TMR0H5                        2938
#define T0PR5                         2939
#define TMR0H6                        2940
#define T0PR6                         2941
#define TMR0H7                        2942
#define T0PR7                         2943
#define T0CON0                        2944
#define T0OUTPS                       2945
#define T0OUTPS0                      2946
#define T0OUTPS1                      2947
#define T0OUTPS2                      2948
#define T0OUTPS3                      2949
#define T016BIT                       2950
#define T0OUT                         2951
#define T0EN                          2952
#define T0CON1                        2953
#define T0PS                          2954
#define T0CKPS                        2955
#define T0CKPS0                       2956
#define T0PS0                         2957
#define T0CKPS1                       2958
#define T0PS1                         2959
#define T0CKPS2                       2960
#define T0PS2                         2961
#define T0CKPS3                       2962
#define T0PS3                         2963
#define T0ASYNC                       2964
#define T0CS                          2965
#define T0CS0                         2966
#define T0CS1                         2967
#define T0CS2                         2968
#define PCON0                         2969
#define BOR                           2970
#define NOT_BOR                       2971
#define nBOR                          2972
#define POR                           2973
#define nPOR                          2974
#define NOT_POR                       2975
#define nRI                           2976
#define NOT_RI                        2977
#define RI                            2978
#define NOT_RMCLR                     2979
#define nRMCLR                        2980
#define RMCLR                         2981
#define NOT_RWDT                      2982
#define nRWDT                         2983
#define RWDT                          2984
#define nWDTWV                        2985
#define WDTWV                         2986
#define NOT_WDTWV                     2987
#define STKUNF                        2988
#define STKOVF                        2989
#define STATUS                        2990
#define C                             2991
#define CARRY                         2992
#define STATUS_DC                     2993
#define ZERO                          2994
#define Z                             2995
#define OV                            2996
#define OVERFLOW                      2997
#define N                             2998
#define NEGATIVE                      2999
#define PD                            3000
#define nPD                           3001
#define NOT_PD                        3002
#define TO                            3003
#define NOT_TO                        3004
#define nTO                           3005
#define FSR2L                         3006
#define PLUSW2                        3007
#define PREINC2                       3008
#define POSTDEC2                      3009
#define POSTINC2                      3010
#define INDF2                         3011
#define FSR1L                         3012
#define PLUSW1                        3013
#define PREINC1                       3014
#define POSTDEC1                      3015
#define POSTINC1                      3016
#define INDF1                         3017
#define WREG                          3018
#define FSR0L                         3019
#define PLUSW0                        3020
#define PREINC0                       3021
#define POSTDEC0                      3022
#define POSTINC0                      3023
#define INDF0                         3024
#define INTCON                        3025
#define INT0EDG                       3026
#define INT1EDG                       3027
#define INT2EDG                       3028
#define IPEN                          3029
#define PEIE                          3030
#define PEIE_GIEL                     3031
#define GIEL                          3032
#define GIE                           3033
#define GIE_GIEH                      3034
#define GIEH                          3035
#define PRODL                         3036
#define PRODH                         3037
#define TABLAT                        3038
#define TBLPTRL                       3039
#define TBLPTRH                       3040
#define TBLPTRU                       3041
#define ACSS                          3042
#define PCL                           3043
#define PCLATH                        3044
#define PCLATH_PCH                    3045
#define PCLATU                        3046
#define PCU                           3047
#define STKPTR0                       3048
#define STKPTR                        3049
#define SP0                           3050
#define STKPTR1                       3051
#define SP1                           3052
#define STKPTR2                       3053
#define SP2                           3054
#define SP3                           3055
#define STKPTR3                       3056
#define STKPTR4                       3057
#define SP4                           3058
#define STKPTR5                       3059
#define SP5                           3060
#define TOSL                          3061
#define TOSH                          3062

#endif // _PIC18F45K40_H_
